In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
mall_data = pd.read_json('../datasets/Mall_Customers.json')
mall_data.head(5)

   customer_id  gender  age  annual_income  spending_score
0            1    Male   19          15000              39
1            2    Male   21          15000              81
2            3  Female   20          16000               6
3            4  Female   23          16000              77
4            5  Female   31          17000              40

In [5]:
average_income = mall_data['annual_income'].mean()
average_income

60560.0

In [6]:
mall_data['above_average_income'] = (mall_data['annual_income'] - average_income) > 0
mall_data.sample(5)

,customer_id,gender,age,annual_income,spending_score,above_average_income
134,135,Male,20,73000,5,True
89,90,Female,50,58000,46,False
50,51,Female,49,42000,52,False
29,30,Female,23,29000,87,False
172,173,Male,36,87000,10,True

In [7]:
mall_data.to_csv('../datasets/mall_data_pro.csv', index=False)